-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 20 2018 г., 18:21
-- Версия сервера: 5.5.53
-- Версия PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `geodezia`
--

-- --------------------------------------------------------

--
-- Структура таблицы `departments`
--

CREATE TABLE `departments` (
  `dep_id` int(11) NOT NULL,
  `dep_name` varchar(255) NOT NULL,
  `dep_text` text NOT NULL,
  `dep_author` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `departments`
--

INSERT INTO `departments` (`dep_id`, `dep_name`, `dep_text`, `dep_author`) VALUES
(3, 'Шӯъбаи нигоҳдории маводҳои Корхонаи воҳиди давлатии аэрогеодезии Душанбе', 'Сардори шӯъба Қурбонбекова Шакармо Амонбековна- хатмкардаи Техникуми сохтмонии шаҳри Душанбе. Дар шӯъбаи нигоҳдории маводҳо тамоми маводҳои махфии корҳои иҷрошудаи топографӣ-геодезӣ нигоҳ дошта мешаванд. Тамоми шӯъбаҳо, гуруҳҳои саҳроӣ ва камералӣ, ки бо маводҳои махфӣ сару кор доранд барои пешбурди корҳо ҳуҷҷатҳои лозимаро аз шӯъбаи нигоҳдории маводҳо дастрас менамоянд. Ба ҳар як сардори гурӯҳ маводҳо аз рўи дафтарҳои ҳисоби шахси дода мешаванд ва баъди ба анҷом расонидани корҳо дар саҳро маводҳо барои нигоҳдорӣ бозгардонида мешаванд.', 'Хамидова Н.Т'),
(4, 'Шӯъбаи кадрҳо', 'Дар давоми солҳо  дар шўъбаи кадрҳо корҳои ҷории даврӣ гузаронида шуданд. Аз ҷумла, ҳуҷҷатҳои шахсони ба кор қабулшуда ва аз кор озодшуда тибқи тартиби муқарраршуда омода карда шуданд, тамоми тағйиротҳо оиди кору ҳаёти шахсии кормандон ба дафтарчаи мењнатӣ, карточкаҳои Т-2 ва варақаи шахсӣ дохил карда шуданд, инчунин маълумотҳо барои фонди иҷтимоии аҳолӣ, шўъбаи 1 омода карда шуданд, ба шаҳрвандон оид ба собиқаи корӣ, номивазкунии корхона, ҷои кор ба миқдори 63 адад маълумотнома пешниҳод карда шуд.	\r\nШумораи умумии кормандон 76 нафарро ташкил медиҳад. Аз аввали сол 26 шартномаи меҳнатӣ баста шуд. Дар давраи ҳисоботӣ 17 нафар ба кор қабул карда шуда, 12 нафар бо хоҳиши худ аз вазифа озод карда шуданд. Дар давоми сол аз тарафи кормандон 19 варақаи корношоямӣ, пешниҳод карда шуд, кормандон 110 маротиба ба сафари хизматӣ фиристода шуданд.', 'Ҳамидова Нигина Тагаевна'),
(5, 'Шӯъбаи банақшагирӣ', 'Иҷрои корҳои банақшагирии иқтисодиро дар асоси санадҳои меъёрию ҳуқиқии Ҷумҳурии Тоҷикистон дар фаъолияти хоҷагидории корхона иҷро менамояд.\r\nАз ҷумла:  \r\n1.1.Тартиб додани нақшаҳои рушд ва иҷтимоии корхона барои миёна муҳлат ва дарозмудат.\r\n1.2. Банақшагирии иҷроиши корҳо дар доираи имконияти базаи техникӣ ва қувваи кории корхона.\r\n1.3. Тартиб додани лоиҳаҳои тарақиёт ва дурнамои фаъолияти корхона. \r\n1.4.Тартиб додани шартномаҳо ва харҷномаҳои иҷроиши корҳо дар асоси нормативҳои қабулгашта бо фармоишгарон.\r\n1.5. Тартиб додани нақшаи истеҳсоли оиди иҷроиши корҳо ва назорат аз рӯи он.\r\n1.6. Тйёр намудани  ҳисоботҳои моҳона, семоҳа ва ҷамъбасти оиди фаъолияти иқтисодию хоҷагидорӣ.\r\n1.7. Дар асоси санадҳои меъёрию ҳуқуқи ва имконияти корхона пешниҳод ва тайёр намудани ҷадвали басти мансабҳо, меъёри корӣ, сарфаи вақт, хароҷоти маҳсулот ва ставкаи корҳо корбайт, тартиб додани санадҳои қабулу супоридани маводҳои иҷроиши корҳо бо фармоишгарон.', 'РАҶАБОВ Диловар Раҷабалиевич');

-- --------------------------------------------------------

--
-- Структура таблицы `documents`
--

CREATE TABLE `documents` (
  `doc_id` int(11) NOT NULL,
  `doc_name` varchar(255) NOT NULL,
  `doc_image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `groups`
--

CREATE TABLE `groups` (
  `id` mediumint(8) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL,
  `description` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `groups`
--

INSERT INTO `groups` (`id`, `name`, `description`) VALUES
(1, 'admin', 'Administrator'),
(2, 'members', 'General User');

-- --------------------------------------------------------

--
-- Структура таблицы `history`
--

CREATE TABLE `history` (
  `history_id` int(11) NOT NULL,
  `history_title` varchar(255) NOT NULL,
  `history_short` varchar(255) NOT NULL,
  `history_text` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `history`
--

INSERT INTO `history` (`history_id`, `history_title`, `history_short`, `history_text`) VALUES
(4, 'Маълумот умуми дар бораи Корхонаи воҳиди давлатии Аэрогеодезии Душанбе', '', 'Дар асоси Қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №246 аз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии миллии кайҳонӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон таъсис ёфтааст.\r\n      Мутобиқи қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №613 аз 28 декабри соли 2006 Корхонаи марказии аэрогеодезии Агенти миллии кайҳонӣ,геодези ва харитасозии назди Ҳукумати  Ҷумҳурии Тоҷикистон ба Корхонаи воҳиди давлатии аэрогеодезии Агентии заминсозӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон ва аз 3 майи соли 2010 дар асоси қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №225 ҳамчун Корхонаи вохиди давлатии аэрогеодезии Душанбе-и Кумитаи давлатии заминсози ва геодезии  Ҷумҳурии Тоҷикистон фаъолият  намуда истодааст.\r\n       Корхона дар асоси Конститутсияи (Сарқонун) Ҷумҳурии Тоҷикистон, Кодекси граджании Ҷумҳурии Тоҷикистон, дигар санадҳои ҳуқуқӣ ва меъёрӣ қарорҳои Агентии заминсозӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон  инчунин Оиномаи корхона фаъолият мекунад.\r\n       Корхона шахси ҳуқуқи буда фаъолияти хоҷагидориро ба амал мебарорад ва дорои баланси мустақил суратҳисоб ва ҳисоботҳои дигар дар бонкҳо ва муасисаҳои қарзии дигар муҳр бо тасвири рамзҳои давлатии Ҷумҳурии Тоҷикистон ва номи расмии корхона, бланк, штамп ва нишони тиҷорати мебошад.\r\n1.2 Мақсад ва вазифаҳои асосии корхона\r\n          Мақсади асосии корхона таъминоти Ҷумҳурии Тоҷикистон, ҳокимияти маҳаллии шаҳру ноҳияҳо ва дигар шахсони ҳуқуқию воқеъи аз маводҳои топографи, геодезӣ, маркшейдери, харитави, маводҳои кадастрӣ дар шакли координат ва баландиҳои пунктҳои геодезӣ, гравиметрӣ, харитаҳои рақамӣ, релифӣ, экологӣ, кадастрӣ ва дигар намуди харитаҳо, наворҳои ҳавоӣ, кайҳонӣ, наворҳои рақамии кайҳонӣ, шакли 3Д, харитахои рақамию электрони, чуғрофи, аэрокайҳони, маркшейдерӣ, муҳандисию геодезӣ,  метрологӣ  ва муҳандисию муҳақиқи мебошад. Қабул ва коркарди расмҳои кайҳони бо истифода аз технологияҳои ҳозиразамон низ яке аз мақсадҳои асосии корхонаи мазкур дар ояндаи наздик мебошад.');

-- --------------------------------------------------------

--
-- Структура таблицы `login_attempts`
--

CREATE TABLE `login_attempts` (
  `id` int(11) UNSIGNED NOT NULL,
  `ip_address` varchar(45) NOT NULL,
  `login` varchar(100) NOT NULL,
  `time` int(11) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `messages`
--

CREATE TABLE `messages` (
  `mess_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `text` varchar(300) NOT NULL,
  `mess_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `messages`
--

INSERT INTO `messages` (`mess_id`, `name`, `email`, `phone`, `text`, `mess_date`) VALUES
(22, 'Ориф', 'orif@mail.ru', '+945893094534', 'Корхонаи мо мехохад бо корхонаи Шумо хамкори кунад. Илтимос ба ракамҳои ман занг занед ва ё ба суроғаи электрониам нависед.Корхонаи мо мехохад бо корхонаи Шумо хамкори кунад. Илтимос ба ракамҳои ман занг занед ва ё ба суроғаи электрониам нависед.', '2018-05-05 13:21:50'),
(25, 'фҷфҷвфҷвфҷв', 'Soib_jon96@inbox.ru', '2323432', 'asfasdfasdfsdfadsfadsfadsfadsf', '2018-05-08 11:53:38'),
(26, 'Соиб', 'Soib_jon96@inbox.ru', '932154845', 'Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём Паём паём паём паём ', '2018-05-12 15:18:09');

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `news_id` int(11) NOT NULL,
  `news_title` varchar(100) NOT NULL,
  `news_short` varchar(300) NOT NULL,
  `news_content` text NOT NULL,
  `news_author` varchar(25) NOT NULL,
  `news_image` varchar(255) NOT NULL,
  `news_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`news_id`, `news_title`, `news_short`, `news_content`, `news_author`, `news_image`, `news_date`) VALUES
(17, 'Кормандони КВД дар ҷраёни корҳои саҳрои', 'Дар асоси Ќарори Њукумати Љумњурии Тољикистон тањти №246 \r\nаз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии \r\nмиллии кайњонї, геодезї ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон таъсис ёфтааст.\r\nМутобиќи ќарори Њукумати Љумњурии Тољикистон тањти №613 \r\nаз 28 декабри соли 2006 Корх', 'Дар асоси Ќарори Њукумати Љумњурии Тољикистон тањти №246 \r\nаз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии \r\nмиллии кайњонї, геодезї ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон таъсис ёфтааст.\r\n\r\nМутобиќи ќарори Њукумати Љумњурии Тољикистон тањти №613 \r\nаз 28 декабри соли 2006 Корхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...Дар асоси Ќарори Њукумати Љумњурии Тољикистон тањти №246 \r\nаз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии \r\nмиллии кайњонї, геодезї ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон таъсис ёфтааст.\r\n\r\nМутобиќи ќарори Њукумати Љумњурии Тољикистон тањти №613 \r\nаз 28 декабри соли 2006 Корхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...', '', 'e143ef0ce404f38ff8714d2dc15e65cd.jpg', '2018-04-24'),
(18, 'корхонаи марказии аэрогеодезии Агенти  миллии кайњон', 'рхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...рхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи', 'рхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...рхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...рхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...рхонаи марказии аэрогеодезии Агенти \r\nмиллии кайњонї,геодези ва харитасозии назди Њукумати \r\nЉумњурии Тољикистон ба Корхонаи воњиди давлатии аэрогеодезии \r\nАгентии заминсозї...', '', '810398e194d29e246e180a686f4d5f8d.JPG', '2018-04-24'),
(20, 'Маълумот умуми дар бораи Корхонаи воҳиди давлатии Аэрогеодезии Душанбе', 'Дар асоси Қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №246 аз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии миллии кайҳонӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон таъсис ёфтааст. Мутобиқи қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №613 аз 28 декабри соли 2006 Корхонаи марк', 'Дар асоси Қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №246 аз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии миллии кайҳонӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон таъсис ёфтааст. Мутобиқи қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №613 аз 28 декабри соли 2006 Корхонаи марказии аэрогеодезии Агенти миллии кайҳонӣ,геодези ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон ба Корхонаи воҳиди давлатии аэрогеодезии Агентии заминсозӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон ва аз 3 майи соли 2010 дар асоси қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №225 ҳамчун Корхонаи вохиди давлатии аэрогеодезии Душанбе-и Кумитаи давлатии заминсози ва геодезии Ҷумҳурии Тоҷикистон фаъолият намуда истодааст. Корхона дар асоси Конститутсияи (Сарқонун) Ҷумҳурии Тоҷикистон, Кодекси граджании Ҷумҳурии Тоҷикистон, дигар санадҳои ҳуқуқӣ ва меъёрӣ қарорҳои Агентии заминсозӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон инчунин Оиномаи корхона фаъолият мекунад. Корхона шахси ҳуқуқи буда фаъолияти хоҷагидориро ба амал мебарорад ва дорои баланси мустақил суратҳисоб ва ҳисоботҳои дигар дар бонкҳо ва муасисаҳои қарзии дигар муҳр бо тасвири рамзҳои давлатии Ҷумҳурии Тоҷикистон ва номи расмии корхона, бланк, штамп ва нишони тиҷорати мебошад. 1.2 Мақсад ва вазифаҳои асосии корхона Мақсади асосии корхона таъминоти Ҷумҳурии Тоҷикистон, ҳокимияти маҳаллии шаҳру ноҳияҳо ва дигар шахсони ҳуқуқию воқеъи аз маводҳои топографи, геодезӣ, маркшейдери, харитави, маводҳои кадастрӣ дар шакли координат ва баландиҳои пунктҳои геодезӣ, гравиметрӣ, харитаҳои рақамӣ, релифӣ, экологӣ, кадастрӣ ва дигар намуди харитаҳо, наворҳои ҳавоӣ, кайҳонӣ, наворҳои рақамии кайҳонӣ, шакли 3Д, харитахои рақамию электрони, чуғрофи, аэрокайҳони, маркшейдерӣ, муҳандисию геодезӣ, метрологӣ ва муҳандисию муҳақиқи мебошад. Қабул ва коркарди расмҳои кайҳони бо истифода аз технологияҳои ҳозиразамон низ яке аз мақсадҳои асосии корхонаи мазкур дар ояндаи наздик мебошад.', '', 'ab0a25d45ec2ce47e46e30a73088990f.jpg', '2018-05-20'),
(21, 'Маълумот умуми дар бораи Корхонаи воҳиди давлатии Аэрогеодезии Душанбе', 'Дар асоси Қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №246 аз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии миллии кайҳонӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон таъсис ёфтааст. Мутобиқи қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №613 аз 28 декабри соли 2006 Корхонаи марк', 'Дар асоси Қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №246 аз 06 июни сол и 2003 Корхонаи марказии аэрогеодези Агентии миллии кайҳонӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон таъсис ёфтааст. Мутобиқи қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №613 аз 28 декабри соли 2006 Корхонаи марказии аэрогеодезии Агенти миллии кайҳонӣ,геодези ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон ба Корхонаи воҳиди давлатии аэрогеодезии Агентии заминсозӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон ва аз 3 майи соли 2010 дар асоси қарори Ҳукумати Ҷумҳурии Тоҷикистон таҳти №225 ҳамчун Корхонаи вохиди давлатии аэрогеодезии Душанбе-и Кумитаи давлатии заминсози ва геодезии Ҷумҳурии Тоҷикистон фаъолият намуда истодааст. Корхона дар асоси Конститутсияи (Сарқонун) Ҷумҳурии Тоҷикистон, Кодекси граджании Ҷумҳурии Тоҷикистон, дигар санадҳои ҳуқуқӣ ва меъёрӣ қарорҳои Агентии заминсозӣ, геодезӣ ва харитасозии назди Ҳукумати Ҷумҳурии Тоҷикистон инчунин Оиномаи корхона фаъолият мекунад. Корхона шахси ҳуқуқи буда фаъолияти хоҷагидориро ба амал мебарорад ва дорои баланси мустақил суратҳисоб ва ҳисоботҳои дигар дар бонкҳо ва муасисаҳои қарзии дигар муҳр бо тасвири рамзҳои давлатии Ҷумҳурии Тоҷикистон ва номи расмии корхона, бланк, штамп ва нишони тиҷорати мебошад. 1.2 Мақсад ва вазифаҳои асосии корхона Мақсади асосии корхона таъминоти Ҷумҳурии Тоҷикистон, ҳокимияти маҳаллии шаҳру ноҳияҳо ва дигар шахсони ҳуқуқию воқеъи аз маводҳои топографи, геодезӣ, маркшейдери, харитави, маводҳои кадастрӣ дар шакли координат ва баландиҳои пунктҳои геодезӣ, гравиметрӣ, харитаҳои рақамӣ, релифӣ, экологӣ, кадастрӣ ва дигар намуди харитаҳо, наворҳои ҳавоӣ, кайҳонӣ, наворҳои рақамии кайҳонӣ, шакли 3Д, харитахои рақамию электрони, чуғрофи, аэрокайҳони, маркшейдерӣ, муҳандисию геодезӣ, метрологӣ ва муҳандисию муҳақиқи мебошад. Қабул ва коркарди расмҳои кайҳони бо истифода аз технологияҳои ҳозиразамон низ яке аз мақсадҳои асосии корхонаи мазкур дар ояндаи наздик мебошад.', '', '89dc6d76fd6b9c8139209312ea6ac2b1.jpg', '2018-05-20');

-- --------------------------------------------------------

--
-- Структура таблицы `partners`
--

CREATE TABLE `partners` (
  `partners_id` int(11) NOT NULL,
  `partners_img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `personals`
--

CREATE TABLE `personals` (
  `person_id` int(11) NOT NULL,
  `person_name` varchar(255) NOT NULL,
  `person_sname` varchar(255) NOT NULL,
  `person_fname` varchar(255) NOT NULL,
  `person_image` varchar(255) NOT NULL,
  `person_text` varchar(300) NOT NULL,
  `person_site` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- Дамп данных таблицы `personals`
--

INSERT INTO `personals` (`person_id`, `person_name`, `person_sname`, `person_fname`, `person_image`, `person_text`, `person_site`) VALUES
(6, 'РАҶАБОВ Диловар  Раҷабалиевич', '', '', 'ef1b2f2b2bc079503d2c03cdf1d503f5.png', 'Сардори шўъбаи банаќшагирии Корхонаи воњиди давлатии аэрогеодезии Душанбеи Кумитаи давлатии заминсозї ва геодезии Љумњурии Тољикистон кор мекунад', ''),
(7, 'КАШИРИНА Людмила Петровна', '', '', '14c493c84e42e6ad221823b6ecab435f.png', 'Сармуњосиби Корхонаи воњиди давлатии аэрогеодезии Душанбеи Кумитаи давлатии заминсозї ва геодезии Љумњурии Тољикистон кор мекунад', ''),
(8, 'ҶЎРАЕВ Ифтихор Ширинҷонович', '', '', 'f40464a802f851e91eedc4a617571122.png', 'Сармуњандиси Корхонаи воњиди давлатии аэрогеодезии Душанбеи Кумитаи давлатии заминсозї ва геодезии Љумњурии Тољикистон кор мекунад', ''),
(9, 'ОДИНАЕВ Шодӣ  Холович', '', '', '1b33baa9658f6277c5b4a9889a476f2c.png', 'Директори Корхонаи воњиди давлатии аэрогеодезии Душанбеи Кумитаи давлатии заминсозї ва геодезии Љумњурии Тољикистон кор мекунад', '');

-- --------------------------------------------------------

--
-- Структура таблицы `pictures`
--

CREATE TABLE `pictures` (
  `pict_id` int(11) NOT NULL,
  `pict_name` varchar(255) NOT NULL,
  `pict_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `pictures`
--

INSERT INTO `pictures` (`pict_id`, `pict_name`, `pict_date`) VALUES
(22, '28368d7a4a3ad8244d1913516a82887c.jpg', '2018-04-28'),
(23, 'cf48ac10ecfaabfbcd2690b19ac6e294.jpg', '2018-04-28'),
(24, 'ca7eb2775e13cf63c020a6e8b84607c5.JPG', '2018-04-28'),
(29, '1e193768466805040a407e0adbd3edc5.JPG', '2018-04-28'),
(35, 'd52ee9e8fd5596f985873862c8a960f2.JPG', '2018-04-28'),
(38, 'd246b5bcc29e1d3ba5ffd461bbdbd503.jpg', '2018-04-28'),
(39, '64f351aff83c5f930b1f8dca99025c7a.jpg', '2018-04-28'),
(40, '18c2649a8c43c8c731f496e7617ad808.JPG', '2018-04-28'),
(41, 'd2e2e2c2254c11e51320217f23cccf49.jpg', '2018-04-28');

-- --------------------------------------------------------

--
-- Структура таблицы `services`
--

CREATE TABLE `services` (
  `service_id` int(11) NOT NULL,
  `service_name` varchar(255) NOT NULL,
  `service_short` varchar(255) NOT NULL,
  `service_text` varchar(500) NOT NULL,
  `service_image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `services`
--

INSERT INTO `services` (`service_id`, `service_name`, `service_short`, `service_text`, `service_image`) VALUES
(7, 'Картографияи рақамӣ ва ГИС', 'Иҷрои корҳои картографии махсус ва аэроаксбардорӣ.', '', '1fd2830c3573558290a882f5c46bb5a8.jpg'),
(8, 'Метрология', 'Санҷиши таҷҳизотҳои геодезӣ ва картографӣ бо истифода аз экспертизаи метрологӣ.', '', '9d09d581f2b9a311438aaeb0f9f9ca29.png'),
(9, 'Геодезия', 'Андозагирии геодезӣ ва гравиметри. Тадқиқотҳои геодинамики бо дақиқии баланди ГНСС андозагири.', '', '6672b7ed092a561cfa91cf895211bd53.jpg');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) UNSIGNED NOT NULL,
  `ip_address` varchar(45) NOT NULL,
  `username` varchar(100) DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `salt` varchar(255) DEFAULT NULL,
  `email` varchar(254) NOT NULL,
  `activation_code` varchar(40) DEFAULT NULL,
  `forgotten_password_code` varchar(40) DEFAULT NULL,
  `forgotten_password_time` int(11) UNSIGNED DEFAULT NULL,
  `remember_code` varchar(40) DEFAULT NULL,
  `created_on` int(11) UNSIGNED NOT NULL,
  `last_login` int(11) UNSIGNED DEFAULT NULL,
  `active` tinyint(1) UNSIGNED DEFAULT NULL,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(50) DEFAULT NULL,
  `company` varchar(100) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `ip_address`, `username`, `password`, `salt`, `email`, `activation_code`, `forgotten_password_code`, `forgotten_password_time`, `remember_code`, `created_on`, `last_login`, `active`, `first_name`, `last_name`, `company`, `phone`) VALUES
(1, '127.0.0.1', 'administrator', '$2a$07$SeBknntpZror9uyftVopmu61qg0ms8Qv1yV6FG.kQOSM.9QhmTo36', '', 'admin@admin.com', '', NULL, NULL, NULL, 1268889823, 1526828631, 1, 'Admin', 'istrator', 'ADMIN', '0');

-- --------------------------------------------------------

--
-- Структура таблицы `users_groups`
--

CREATE TABLE `users_groups` (
  `id` int(11) UNSIGNED NOT NULL,
  `user_id` int(11) UNSIGNED NOT NULL,
  `group_id` mediumint(8) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `users_groups`
--

INSERT INTO `users_groups` (`id`, `user_id`, `group_id`) VALUES
(1, 1, 1),
(2, 1, 2);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`dep_id`);

--
-- Индексы таблицы `documents`
--
ALTER TABLE `documents`
  ADD PRIMARY KEY (`doc_id`);

--
-- Индексы таблицы `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `history`
--
ALTER TABLE `history`
  ADD PRIMARY KEY (`history_id`);

--
-- Индексы таблицы `login_attempts`
--
ALTER TABLE `login_attempts`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`mess_id`);

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`news_id`);

--
-- Индексы таблицы `partners`
--
ALTER TABLE `partners`
  ADD PRIMARY KEY (`partners_id`);

--
-- Индексы таблицы `personals`
--
ALTER TABLE `personals`
  ADD PRIMARY KEY (`person_id`);

--
-- Индексы таблицы `pictures`
--
ALTER TABLE `pictures`
  ADD PRIMARY KEY (`pict_id`);

--
-- Индексы таблицы `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`service_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users_groups`
--
ALTER TABLE `users_groups`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uc_users_groups` (`user_id`,`group_id`),
  ADD KEY `fk_users_groups_users1_idx` (`user_id`),
  ADD KEY `fk_users_groups_groups1_idx` (`group_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `departments`
--
ALTER TABLE `departments`
  MODIFY `dep_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT для таблицы `documents`
--
ALTER TABLE `documents`
  MODIFY `doc_id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `groups`
--
ALTER TABLE `groups`
  MODIFY `id` mediumint(8) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- AUTO_INCREMENT для таблицы `history`
--
ALTER TABLE `history`
  MODIFY `history_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- AUTO_INCREMENT для таблицы `login_attempts`
--
ALTER TABLE `login_attempts`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `messages`
--
ALTER TABLE `messages`
  MODIFY `mess_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;
--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `news_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
--
-- AUTO_INCREMENT для таблицы `partners`
--
ALTER TABLE `partners`
  MODIFY `partners_id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `personals`
--
ALTER TABLE `personals`
  MODIFY `person_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT для таблицы `pictures`
--
ALTER TABLE `pictures`
  MODIFY `pict_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;
--
-- AUTO_INCREMENT для таблицы `services`
--
ALTER TABLE `services`
  MODIFY `service_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `users_groups`
--
ALTER TABLE `users_groups`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `users_groups`
--
ALTER TABLE `users_groups`
  ADD CONSTRAINT `fk_users_groups_groups1` FOREIGN KEY (`group_id`) REFERENCES `groups` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_users_groups_users1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
